{
    "content": {
    "professionalStandards": [
        {
          "id": "27ae8663b32c4a35b7f69c921550dbc0",
          "content": "06.004 Специалист по тестированию в области информационных технологий"
        },
        {
          "id": "a5a556934c05465faaaee028468bb10c",
          "content": "06.001 Программист"
        },
        {
          "id": "ab4bd601cfa54252b50428aec99bce1f",
          "content": "06.015 Специалист по информационным системам"
        },
        {
          "id": "13bb944e03a2458992a5cc1541c475e8",
          "content": "06.016 Руководитель проектов в области информационных технологий"
        },
        {
          "id": "83dbaa8a50fe4669a806d633eab890f2",
          "content": "06.019 Технический писатель (специалистпотехническойдокументациивобласти информационных технологий)"
        },
        {
          "id": "6b620fa99b6b43db8bec6cb67201fef2",
          "content": "06.022 Системный аналитик"
        },
        {
          "id": "467ffc4efead4ea9b5a2160689a37e59",
          "content": "06.025 Специалист по дизайну графических и пользовательских интерфейсов"
        },
        {
          "id": "548aeabaacce4043b4f69120b0b9bf03",
          "content": "06.026 Системный администратор информационно-коммуникационных систем"
        },
        {
          "id": "334ee8d227984f3499eaf9467a4d7b00",
          "content": "06.028 Системный программист"
        },
        {
          "id": "9290e65b60084e1b937383c123673800",
          "content": "06.011 Администратор баз данных"
        }
       
      ],
      
      "universalCompetencyRows": [
        {
          "competence": {
            "id": "241e38b666eb4fa68950b9e9e3d82557",
            "code": "УК-1.",
            "title": "Способен осуществлять поиск, критический анализ и синтез информации, применять системный подход для решения поставленных задач"
          },
         "indicators": [
            {
              "id": "9bde16a599cd42e89cf50488c54d76ad",
              "code": "УК-1.1.",
              "content": "Знать: методики поиска, сбора и обработки информации; актуальные российские и зарубежные источники информации в сфере профессиональной деятельности; метод системного анализа.\n"
            },
            {
              "id": "44374c9eb9ea4a0787e25f8c1dfd9358",
              "code": "УК-1.2.",
              "content": "Уметь: применять методики поиска, сбора и обработки информации;  осуществлять критический анализ и синтез информации, полученной из разных источников; применять системный подход для решения поставленных задач.\n"
            },
            {
              "id": "a4bcc5b057814529b22d4c225b619a23",
              "code": "УК-1.3.",
              "content": "Владеть: методами поиска, сбора и обработки, критического анализа и синтеза информации;  методикой системного подхода для решения поставленных задач."
            }
          ]
        },
        {
          "competence": {
            "id": "0561fa37a80746e1bc55da695a9b2462",
            "code": "УК-2.",
            "title": "Способен определять круг задач в рамках поставленной цели и выбирать оптимальные способы их решения, исходя из действующих правовых норм, имеющихся ресурсов и ограничений"
          },
          "indicators": [
            {
              "id": "1fcd5b0707cb43b5922283b65f972589",
              "code": "УК-2.1.",
              "content": "Знать: виды ресурсов и ограничений для решения профессиональных задач; основные методы оценки разных способов решения задач; действующее законодательство и правовые нормы, регулирующие профессиональную деятельность."
            },
            {
              "id": "c926aaa48a224871969a63e1db0a1563",
              "code": "УК-2.2.",
              "content": "Уметь: проводить анализ поставленной цели и формулировать задачи, которые необходимо решить для ее достижения;  анализировать альтернативные варианты для достижения намеченных результатов;  использовать нормативно-правовую документацию в сфере профессиональной деятельности.\n"
            },
            {
              "id": "e1b035a1ad4d476bb1ecf3a186de8860",
              "code": "УК-2.3.",
              "content": "Владеть: методиками разработки цели и задач проекта;  методами оценки потребности в ресурсах, продолжительности и стоимости проекта;  навыками работы с нормативно-правовой документацией.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "2d745064c6484d50b22b16f5ef493abb",
            "code": "УК-3.",
            "title": "Способен осуществлять социальное взаимодействие и реализовывать свою роль в команде"
          },
          "indicators": [
            {
              "id": "78cf8fdbbc254daab9c92d21a6862eb7",
              "code": "УК-3.1.",
              "content": "Знать: основные приемы и нормы социального взаимодействия;  основные понятия и методы конфликтологии, технологии межличностной и групповой коммуникации в деловом взаимодействии.\n"
            },
            {
              "id": "f9d2abfb6e614816a58ddaa56df306ac",
              "code": "УК-3.2.",
              "content": "Уметь: устанавливать и поддерживать контакты, обеспечивающие успешную работу в коллективе; применять основные методы и нормы социального взаимодействия для реализации своей роли и взаимодействия внутри команды.\n"
            },
            {
              "id": "642a72f06ec44aa6a65738a9ce135997",
              "code": "УК-3.3.",
              "content": "Владеть: простейшими методами и приемами социального взаимодействия и работы в команде.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "0908aecfb56e4fc9bf24e5b660e9851b",
            "code": "УК-4.",
            "title": "Способен осуществлять деловую коммуникацию в устной и письменной формах на государственном языке Российской Федерации и иностранном(ых) языке(ах)"
          },
          "indicators": [
            {
              "id": "938b2ea0cbe54eeeba5347b5933bf881",
              "code": "УК-4.1.",
              "content": "Знать: принципы построения устного и письменного высказывания на русском и  иностранном языках; правила и закономерности деловой устной и письменной коммуникации.\n"
            },
            {
              "id": "ce735a3ec9db4502b30968e432ba8fbc",
              "code": "УК-4.2.",
              "content": "Уметь: применять на практике деловую коммуникацию в устной и письменной формах, методы и навыки делового общения на русском и иностранном языках.\n"
            },
            {
              "id": "bbe9938bd65943a89b042332fb99635b",
              "code": "УК-4.3.",
              "content": "Владеть: навыками чтения и перевода текстов на иностранном языке в профессиональном общении; навыками деловых коммуникаций в устной и письменной форме на русском и иностранном языках;  методикой составления суждения в межличностном деловом общении на русском и иностранном языках.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "ae4c611ca655483aa444d6d728ba747b",
            "code": "УК-5.",
            "title": "Способен воспринимать межкультурное разнообразие общества в социально-историческом, этическом и философском контекстах"
          },
          "indicators": [
            {
              "id": "8c421fd473ed4ae3a8ddb1d0a40f263c",
              "code": "УК-5.1.",
              "content": "Знать: закономерности и особенности социально-исторического развития различных культур в этическом и философском контексте.\n"
            },
            {
              "id": "b589cea4045d478b96a689814b1d5885",
              "code": "УК-5.2.",
              "content": "Уметь: понимать и воспринимать разнообразие общества в социально-историческом, этическом и философском контекстах."
            },
            {
              "id": "c74d28e998db47c1a8a40888c915f044",
              "code": "УК-5.3.",
              "content": "Владеть: простейшими методами адекватного восприятия межкультурного разнообразия общества в социально-историческом, этическом и философском контекстах; навыками общения в мире культурного многообразия с использованием этических норм поведения.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "cb9d7107dd53415aa0aedb1de74be49e",
            "code": "УК-6.",
            "title": "Способен управлять своим временем, выстраивать и реализовывать траекторию саморазвития на основе принципов образования в течение всей жизни"
          },
          "indicators": [
            {
              "id": "de616fce727f4eb5babd9eb2281b8289",
              "code": "УК-6.1.",
              "content": "Знать: основные приемы эффективного управления собственным временем;   основные методики самоконтроля, саморазвития и самообразования на протяжении всей жизни.\n"
            },
            {
              "id": "219bedad018145f7a62a4487e81fa291",
              "code": "УК-6.2.",
              "content": "Уметь: эффективно планировать и контролировать собственное время;  использовать методы саморегуляции, саморазвития и самообучения.\n"
            },
            {
              "id": "b2625a749c6b4ad598bbdb55eeb2a050",
              "code": "УК-6.3.",
              "content": "Владеть: методами управления собственным временем;   технологиями приобретения, использования и обновления социокультурных и профессиональных знаний, умений и навыков; методиками саморазвития и самообразования в течение всей жизни.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "3ca659ac503143abbaa43f9b8722794f",
            "code": "УК-7.",
            "title": "Способен поддерживать должный уровень физической подготовленности для обеспечения полноценной социальной и профессиональной деятельности"
          },
          "indicators": [
            {
              "id": "895e3c479d2a4d6fbb16a589455253fe",
              "code": "УК-7.1.",
              "content": "Знать: виды физических упражнений; роль и значение физической культуры в жизни человека и общества; научно-практические основы физической культуры, профилактики вредных привычек  и здорового образа и стиля жизни.\n"
            },
            {
              "id": "f0865cec39e642bd95924798e89c2cb3",
              "code": "УК-7.2.",
              "content": "Уметь: применять на практике разнообразные средства физической культуры, спорта и туризма для сохранения и укрепления здоровья и психофизической подготовки; использовать средства и методы физического воспитания для профессионально-личностного развития, физического самосовершенствования, формирования здорового образа и стиля жизни.\n"
            },
            {
              "id": "fbfa9d8b511d44b9bfa444519c5484d0",
              "code": "УК-7.3.",
              "content": "Владеть: средствами и методами укрепления индивидуального здоровья для обеспечения полноценной социальной и профессиональной деятельности.\n"
            }
          ]
        },
        {
          "competence": {
            "id": "a06413491d1d4a61b7866dfdc175c914",
            "code": "УК-8.",
            "title": "Способен создавать и поддерживать безопасные условия жизнедеятельности, в том числе при возникновении чрезвычайных ситуаций"
          },
          "indicators": [
            {
              "id": "32baafb8368e4495b2b15ff3f595066a",
              "code": "УК-8.1.",
              "content": "Знать: классификацию и источники чрезвычайных ситуаций природного и техногенного происхождения;  причины, признаки и последствия опасностей, способы защиты от чрезвычайных  ситуаций; принципы организации безопасности труда на предприятии, технические средства защиты людей в  условиях чрезвычайной ситуации.\n"
            },
            {
              "id": "412ab386bc804f53ae0e80ee5f6cbe92",
              "code": "УК-8.2.",
              "content": "Уметь: поддерживать безопасные условия жизнедеятельности; выявлять признаки, причины и условия возникновения чрезвычайных ситуаций; оценивать вероятность возникновения потенциальной опасности и принимать меры по ее предупреждению.\n"
            },
            {
              "id": "5afda9a98c384f469940eb1f5894fad3",
              "code": "УК-8.3.",
              "content": "Владеть: методами прогнозирования возникновения опасных или чрезвычайных ситуаций; навыками по применению основных методов защиты в условиях чрезвычайных ситуаций.\n"
            }
          ]
        }
      ],
            
      "commonCompetencyRows": [
        {
          "competence": {
            "id": "e65ed1311041479994e94d20293a4979",
            "code": "ОПК-1.",
            "title": "Способен применять естественнонаучные и общеинженерные знания, методы математического анализа и моделирования, теоретического и экспериментального исследования в профессиональной деятельности"
          },
          "indicators": [
            {
              "id": "2d564cb5a73142b0b6996e27efa3f897",
              "code": "ОПК-1.1.",
              "content": "Знать: основы математики, физики, вычислительной техники и программирования."
            },
            {
              "id": "87f10f03d77343a09d193fcbbf31403a",
              "code": "ОПК-1.2.",
              "content": "Уметь: решать стандартные профессиональные задачи с применением естественнонаучных и общеинженерных знаний, методов математического анализа и моделирования."
            },
            {
              "id": "8058d81558af4a9da6589fd14371c2c4",
              "code": "ОПК-1.3.",
              "content": "Иметь навыки: теоретического и экспериментального исследования объектов профессиональной деятельности."
            }
          ]
        },
        {
          "competence": {
            "id": "88309177eb274d84b75b812082238f65",
            "code": "ОПК-2.",
            "title": "Способен использовать современные информационные технологии и программные средства, в том числе отечественного производства, при решении задач профессиональной деятельности"
          },
          "indicators": [
            {
              "id": "286fd3c981744150a7d79a18637d7735",
              "code": "ОПК-2.1.",
              "content": "Знать: современные информационные технологии и программные средства, в том числе отечественного производства, при решении задач профессиональной деятельности."
            },
            {
              "id": "d628db1bf92146e59bd1ba2685a43368",
              "code": "ОПК-2.2.",
              "content": "Уметь: выбирать современные информационные технологии и программные средства, в том числе отечественного производства, при решении задач профессиональной деятельности."
            },
            {
              "id": "77fe2d9d82f84d93a66469fa00298710",
              "code": "ОПК-2.3.",
              "content": "Иметь навыки: применения современных информационных технологий и программных средств, в том числе отечественного производства, при решении задач профессиональной деятельности."
            }
          ]
        },
        {
          "competence": {
            "id": "8b70fd66465c4470bc395564dca34ee1",
            "code": "ОПК-3.",
            "title": "Способен решать стандартные задачи профессиональной деятельности на основе информационной и библиографической культуры с применением информационно-коммуникационных технологий и с учетом основных требований информационной безопасности"
          },
          "indicators": [
            {
              "id": "991c3959035442e3bc820b486bd48d52",
              "code": "ОПК-3.1.",
              "content": "Знать: принципы, методы и средства решения стандартных задач профессиональной деятельности на основе информационной и библиографической культуры с применением информационно-коммуникационных технологий и с учетом основных требований информационной безопасности."
            },
            {
              "id": "5e70740756934781aeae5b387a4a6e13",
              "code": "ОПК-3.2.",
              "content": "Уметь: решать стандартные задачи профессиональной деятельности на основе информационной и библиографической культуры с применением информационно-коммуникационных технологий и с учетом основных требований информационной безопасности."
            },
            {
              "id": "11a9624506ee4581adb250fa0195b64b",
              "code": "ОПК-3.3.",
              "content": "Иметь навыки: подготовки обзоров, аннотаций, составления рефератов, научных докладов, публикаций и библиографии по научно-исследовательской работе с учетом требований информационной безопасности."
            }
          ]
        },
        {
          "competence": {
            "id": "90ca041cc60744528a22827408484faf",
            "code": "ОПК-4.",
            "title": "Способен участвовать в разработке технической документации, связанной с профессиональной деятельностью с использованием стандартов, норм и правил"
          },
          "indicators": [
            {
              "id": "1274c0299dda4455816b59e22a8aac1f",
              "code": "ОПК-4.1.",
              "content": "Знать: основные стандарты оформления технической документации на различных стадиях жизненного цикла информационной системы."
            },
            {
              "id": "82e0a2d324714c82a7d6b6a226334067",
              "code": "ОПК-4.2.",
              "content": "Уметь: применять стандарты оформления технической документации на различных стадиях жизненного цикла информационной системы."
            },
            {
              "id": "553392e0048c4e4b9d5259067f86936c",
              "code": "ОПК-4.3.",
              "content": "Иметь навыки: составления технической документации на различных этапах жизненного цикла информационной системы."
            }
          ]
        },
        {
          "competence": {
            "id": "d5f7ceac2ea343d083f1236510f790ff",
            "code": "ОПК-5.",
            "title": "Способен инсталлировать программное и аппаратное обеспечение для информационных и автоматизированных систем"
          },
          "indicators": [
            {
              "id": "af78daffb3ea4287bd1990b099a48a4b",
              "code": "ОПК-5.1.",
              "content": "Знать: основы системного администрирования, администрирования СУБД, современные стандарты информационного взаимодействия систем."
            },
            {
              "id": "019bb27f6ffc4935af8cfda1f15ec60f",
              "code": "ОПК-5.2.",
              "content": "Уметь: выполнять параметрическую настройку информационных и автоматизированных систем."
            },
            {
              "id": "489794b4bb174e60988ccd6601f2b97b",
              "code": "ОПК-5.3.",
              "content": "Иметь навыки: инсталляции программного и аппаратного обеспечения информационных и автоматизированных систем."
            }
          ]
        },
        {
          "competence": {
            "id": "b5b49d21278e40f586eaee487d0e8663",
            "code": "ОПК-6.",
            "title": "Способен разрабатывать алгоритмы и программы, пригодные для практического применения в области информационных систем и технологий"
          },
          "indicators": [
            {
              "id": "59a25b9930fe434d9139a2f32432680c",
              "code": "ОПК-6.1.",
              "content": "Знать: методы алгоритмизации, языки и технологии программирования, пригодные для практического применения в области информационных систем и технологий."
            },
            {
              "id": "df6e7279d10e4e3095b7f11cb2408c9d",
              "code": "ОПК-6.2.",
              "content": "Уметь: применять методы алгоритмизации, языки и технологии программирования при решении профессиональных задач в области информационных систем и технологий."
            },
            {
              "id": "19fe3375e7424b6a9b7f76a055bb1571",
              "code": "ОПК-6.3.",
              "content": "Иметь навыки: программирования, отладки и тестирования прототипов программно-технических комплексов задач."
            }
          ]
        },
        {
          "competence": {
            "id": "2ccdc4c460b54c28a57865f2b33c5aee",
            "code": "ОПК-7.",
            "title": "Способен осуществлять выбор платформ и инструментальных программно-аппаратных средств для реализации информационных систем"
          },
          "indicators": [
            {
              "id": "631dde40c0ff4692a2e1cff78d6a8063",
              "code": "ОПК-7.1.",
              "content": "Знать: основные платформы, технологии и инструментальные программно-аппаратные средства для реализации информационных систем."
            },
            {
              "id": "786a7e3d002f438da793ec83f445287e",
              "code": "ОПК-7.2.",
              "content": "Уметь: осуществлять выбор платформ и инструментальных программно- аппаратных средств для реализации информационных систем, применять современные технологии реализации информационных систем."
            },
            {
              "id": "9898fa2585aa4a009cd16e05ffec9284",
              "code": "ОПК-7.3.",
              "content": "Иметь навыки: владения технологиями и инструментальными программно-аппаратными средствами для реализации информационных систем."
            }
          ]
        },
        {
          "competence": {
            "id": "88131c360c274ad594157d760bb129d5",
            "code": "ОПК-8.",
            "title": "Способен применять математические модели, методы и средства проектирования информационных и автоматизированных систем"
          },
          "indicators": [
            {
              "id": "43a9232bc6ae4f11b1ff1baa7d632452",
              "code": "ОПК-8.1.",
              "content": "Знать: методологию и основные методы математического моделирования, классификацию и условия применения моделей, основные методы и средства проектирования информационных и автоматизированных систем, инструментальные средства моделирования и проектирования информационных и автоматизированных систем."
            },
            {
              "id": "dea8ef7c086846bea1e9aac55ca92c2b",
              "code": "ОПК-8.2.",
              "content": "Уметь: применять на практике математические модели, методы и средства проектирования и автоматизации систем на практике."
            },
            {
              "id": "5dae63c96cd84d34a5aaf19341aa9ffb",
              "code": "ОПК-8.3.",
              "content": "Иметь навыки: моделирования и проектирования информационных и автоматизированных систем."
            }
          ]
        }
      ]
     
    }
    
    
  
  
}